Infineon/AURIX_code_examples/code_examples/OneEye_DAS_QuickStart_1_KIT_TC375_LK/Libraries/Infra/Sfr/TC37x/IfxGtm_reg.h
/** \brief EA0A0, ATOM4 Channel 1 Interrupt Notification Register */
#define GTM_ATOM4_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EA0A0u)

/** \brief EA0A4, ATOM4 Channel 1 Interrupt Enable Register */
#define GTM_ATOM4_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EA0A4u)

/** \brief EA0A8, ATOM4 Channel 1 Software Interrupt Generation Register */
#define GTM_ATOM4_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EA0A8u)

/** \brief EA0AC, ATOM4 Channel 1 Interrupt Mode Configuration Register */
#define GTM_ATOM4_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EA0ACu)

/** \brief EA100, ATOM4 Channel 2 ARU read address Register */
#define GTM_ATOM4_CH2_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EA100u)

/** \brief EA104, ATOM4 Channel 2 Control Register */
#define GTM_ATOM4_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EA104u)

/** \brief EA104, ATOM4 Channel 2 Control Register in SOMB Mode */
#define GTM_ATOM4_CH2_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EA104u)

/** \brief EA104, ATOM4 Channel 2 Control Register in SOMC Mode */
#define GTM_ATOM4_CH2_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EA104u)

/** \brief EA104, ATOM4 Channel 2 Control Register in SOMI Mode */
#define GTM_ATOM4_CH2_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EA104u)

/** \brief EA104, ATOM4 Channel 2 Control Register in SOMP Mode */
#define GTM_ATOM4_CH2_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EA104u)

/** \brief EA104, ATOM4 Channel 2 Control Register in SOMS Mode */
#define GTM_ATOM4_CH2_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EA104u)

/** \brief EA108, ATOM4 Channel 2 CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH2_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EA108u)

/** \brief EA10C, ATOM4 Channel 2 CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH2_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EA10Cu)

/** \brief EA110, ATOM4 Channel 2 CCU0 Compare Register */
#define GTM_ATOM4_CH2_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EA110u)

/** \brief EA114, ATOM4 Channel 2 CCU1 Compare Register */
#define GTM_ATOM4_CH2_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EA114u)

/** \brief EA118, ATOM4 Channel 2 CCU0 Counter Register */
#define GTM_ATOM4_CH2_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EA118u)

/** \brief EA11C, ATOM4 Channel 2 Status Register */
#define GTM_ATOM4_CH2_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EA11Cu)

/** \brief EA120, ATOM4 Channel 2 Interrupt Notification Register */
#define GTM_ATOM4_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EA120u)

/** \brief EA124, ATOM4 Channel 2 Interrupt Enable Register */
#define GTM_ATOM4_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EA124u)

/** \brief EA128, ATOM4 Channel 2 Software Interrupt Generation Register */
#define GTM_ATOM4_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EA128u)

/** \brief EA12C, ATOM4 Channel 2 Interrupt Mode Configuration Register */
#define GTM_ATOM4_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EA12Cu)

/** \brief EA180, ATOM4 Channel 3 ARU read address Register */
#define GTM_ATOM4_CH3_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EA180u)

/** \brief EA184, ATOM4 Channel 3 Control Register */
#define GTM_ATOM4_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EA184u)

/** \brief EA184, ATOM4 Channel 3 Control Register in SOMB Mode */
#define GTM_ATOM4_CH3_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EA184u)

/** \brief EA184, ATOM4 Channel 3 Control Register in SOMC Mode */
#define GTM_ATOM4_CH3_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EA184u)

/** \brief EA184, ATOM4 Channel 3 Control Register in SOMI Mode */
#define GTM_ATOM4_CH3_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EA184u)

/** \brief EA184, ATOM4 Channel 3 Control Register in SOMP Mode */
#define GTM_ATOM4_CH3_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EA184u)

/** \brief EA184, ATOM4 Channel 3 Control Register in SOMS Mode */
#define GTM_ATOM4_CH3_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EA184u)

/** \brief EA188, ATOM4 Channel 3 CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH3_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EA188u)

/** \brief EA18C, ATOM4 Channel 3 CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH3_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EA18Cu)

/** \brief EA190, ATOM4 Channel 3 CCU0 Compare Register */
#define GTM_ATOM4_CH3_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EA190u)

/** \brief EA194, ATOM4 Channel 3 CCU1 Compare Register */
#define GTM_ATOM4_CH3_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EA194u)

/** \brief EA198, ATOM4 Channel 3 CCU0 Counter Register */
#define GTM_ATOM4_CH3_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EA198u)

/** \brief EA19C, ATOM4 Channel 3 Status Register */
#define GTM_ATOM4_CH3_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EA19Cu)

/** \brief EA1A0, ATOM4 Channel 3 Interrupt Notification Register */
#define GTM_ATOM4_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EA1A0u)

/** \brief EA1A4, ATOM4 Channel 3 Interrupt Enable Register */
#define GTM_ATOM4_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EA1A4u)

/** \brief EA1A8, ATOM4 Channel 3 Software Interrupt Generation Register */
#define GTM_ATOM4_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EA1A8u)

