Infineon/AURIX_code_examples/code_examples/OneEye_DAS_QuickStart_1_KIT_TC375_LK/Libraries/Infra/Sfr/TC37x/IfxGtm_reg.h
/** \brief EAA90, ATOM5 Channel 5 CCU0 Compare Register */
#define GTM_ATOM5_CH5_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EAA90u)

/** \brief EAA94, ATOM5 Channel 5 CCU1 Compare Register */
#define GTM_ATOM5_CH5_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EAA94u)

/** \brief EAA98, ATOM5 Channel 5 CCU0 Counter Register */
#define GTM_ATOM5_CH5_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EAA98u)

/** \brief EAA9C, ATOM5 Channel 5 Status Register */
#define GTM_ATOM5_CH5_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EAA9Cu)

/** \brief EAAA0, ATOM5 Channel 5 Interrupt Notification Register */
#define GTM_ATOM5_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EAAA0u)

/** \brief EAAA4, ATOM5 Channel 5 Interrupt Enable Register */
#define GTM_ATOM5_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EAAA4u)

/** \brief EAAA8, ATOM5 Channel 5 Software Interrupt Generation Register */
#define GTM_ATOM5_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EAAA8u)

/** \brief EAAAC, ATOM5 Channel 5 Interrupt Mode Configuration Register */
#define GTM_ATOM5_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EAAACu)

/** \brief EAB00, ATOM5 Channel 6 ARU read address Register */
#define GTM_ATOM5_CH6_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EAB00u)

/** \brief EAB04, ATOM5 Channel 6 Control Register */
#define GTM_ATOM5_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EAB04u)

/** \brief EAB04, ATOM5 Channel 6 Control Register in SOMB Mode */
#define GTM_ATOM5_CH6_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EAB04u)

/** \brief EAB04, ATOM5 Channel 6 Control Register in SOMC Mode */
#define GTM_ATOM5_CH6_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EAB04u)

/** \brief EAB04, ATOM5 Channel 6 Control Register in SOMI Mode */
#define GTM_ATOM5_CH6_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EAB04u)

/** \brief EAB04, ATOM5 Channel 6 Control Register in SOMP Mode */
#define GTM_ATOM5_CH6_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EAB04u)

/** \brief EAB04, ATOM5 Channel 6 Control Register in SOMS Mode */
#define GTM_ATOM5_CH6_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EAB04u)

/** \brief EAB08, ATOM5 Channel 6 CCU0 Compare Shadow Register */
#define GTM_ATOM5_CH6_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EAB08u)

/** \brief EAB0C, ATOM5 Channel 6 CCU1 Compare Shadow Register */
#define GTM_ATOM5_CH6_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EAB0Cu)

/** \brief EAB10, ATOM5 Channel 6 CCU0 Compare Register */
#define GTM_ATOM5_CH6_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EAB10u)

/** \brief EAB14, ATOM5 Channel 6 CCU1 Compare Register */
#define GTM_ATOM5_CH6_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EAB14u)

/** \brief EAB18, ATOM5 Channel 6 CCU0 Counter Register */
#define GTM_ATOM5_CH6_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EAB18u)

/** \brief EAB1C, ATOM5 Channel 6 Status Register */
#define GTM_ATOM5_CH6_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EAB1Cu)

/** \brief EAB20, ATOM5 Channel 6 Interrupt Notification Register */
#define GTM_ATOM5_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EAB20u)

/** \brief EAB24, ATOM5 Channel 6 Interrupt Enable Register */
#define GTM_ATOM5_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EAB24u)

/** \brief EAB28, ATOM5 Channel 6 Software Interrupt Generation Register */
#define GTM_ATOM5_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EAB28u)

/** \brief EAB2C, ATOM5 Channel 6 Interrupt Mode Configuration Register */
#define GTM_ATOM5_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EAB2Cu)

/** \brief EAB80, ATOM5 Channel 7 ARU read address Register */
#define GTM_ATOM5_CH7_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EAB80u)

/** \brief EAB84, ATOM5 Channel 7 Control Register */
#define GTM_ATOM5_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EAB84u)

/** \brief EAB84, ATOM5 Channel 7 Control Register in SOMB Mode */
#define GTM_ATOM5_CH7_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EAB84u)

/** \brief EAB84, ATOM5 Channel 7 Control Register in SOMC Mode */
#define GTM_ATOM5_CH7_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EAB84u)

/** \brief EAB84, ATOM5 Channel 7 Control Register in SOMI Mode */
#define GTM_ATOM5_CH7_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EAB84u)

/** \brief EAB84, ATOM5 Channel 7 Control Register in SOMP Mode */
#define GTM_ATOM5_CH7_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EAB84u)

/** \brief EAB84, ATOM5 Channel 7 Control Register in SOMS Mode */
#define GTM_ATOM5_CH7_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EAB84u)

/** \brief EAB88, ATOM5 Channel 7 CCU0 Compare Shadow Register */
#define GTM_ATOM5_CH7_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EAB88u)

/** \brief EAB8C, ATOM5 Channel 7 CCU1 Compare Shadow Register */
#define GTM_ATOM5_CH7_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EAB8Cu)

/** \brief EAB90, ATOM5 Channel 7 CCU0 Compare Register */
#define GTM_ATOM5_CH7_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EAB90u)

/** \brief EAB94, ATOM5 Channel 7 CCU1 Compare Register */
#define GTM_ATOM5_CH7_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EAB94u)

/** \brief EAB98, ATOM5 Channel 7 CCU0 Counter Register */
#define GTM_ATOM5_CH7_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EAB98u)

/** \brief EAB9C, ATOM5 Channel 7 Status Register */
#define GTM_ATOM5_CH7_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EAB9Cu)

/** \brief EABA0, ATOM5 Channel 7 Interrupt Notification Register */
#define GTM_ATOM5_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EABA0u)

